### Pandas
- Pandas is an open-source python library that uses powerful data structures to provide high-performance data manipulation and analysis.
- It provides a variety of data structures and operations for manipulating numerical data and time series.
- This library is based on the NumPy library.

Pandas Objects
- Pandas objects can be thought of as enhanced version of NumPy structured arrays in which the rows and columns are identified with labels rather than simple integer indices.
- There are three fundamental pandas data structures:<br>
    1. Series<br>
    2. DataFrame<br>
    3. Index

Series
- Pandas series is a labelled one-dimensional array that can hold any type of data(integer, string, float, python object, and so on).
- Pandas series is simply a columns in an excel spreadsheet.
- Using the Series() method, we can easily convert a list, tuple, or dictionary into a series.

Creating a series

In [4]:
import pandas as pd
import numpy as np

myser=pd.Series()
print(myser)

data=np.array(['g','e','e','k','s'])
print(data)
myser=pd.Series(data)
print(myser)
myser[0]

Series([], dtype: object)
['g' 'e' 'e' 'k' 's']
0    g
1    e
2    e
3    k
4    s
dtype: object

'g'

Creating a series from lists

In [5]:
mylist=[10,20,30,40,50]
print(type(mylist))
myseri=pd.Series(mylist)
print(myseri)
print(type(myseri))

<class 'list'>
0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

Pandas Index
- Pandas index is an efficient tool for extracting particular rows and columns of data from a DataFrame.
- Its job is to organise data and make it easily accessible.

Creating Index

In [9]:
data=pd.read_csv("airlines.csv")
print(data)

                                              Name IATA ICAO         Callsign  \
0                                   Private flight    -  NaN              NaN
1                                      135 Airways  NaN  GNL          GENERAL
2                                    1Time Airline   1T  RNX          NEXTIME
3     2 Sqn No 1 Elementary Flying Training School  NaN  WYT              NaN
4                                  213 Flight Unit  NaN  TFU              NaN
...                                            ...  ...  ...              ...
6156                                   GX Airlines  NaN  CBG            SPRAY
6157                        Lynx Aviation (L3/SSX)  NaN  SSX           Shasta
6158                               Jetgo Australia   JG   \N              NaN
6159                                  Air Carnival   2S   \N              NaN
6160                                 Svyaz Rossiya   7R  SJM  RussianConnecty

             Country Active
0                NaN      Y
1      United States      N
2       South Africa      Y
3     United Kingdom      N
4             Russia      N
...              ...    ...
6156           China      Y
6157   United States      N
6158       Australia      Y
6159           India      Y
6160          Russia      Y

[6161 rows x 6 columns]

In [10]:
# head() method give first 5 rows data from file
data.head()

,Name,IATA,ICAO,Callsign,Country,Active
0,Private flight,-,NaN,NaN,NaN,Y
1,135 Airways,NaN,GNL,GENERAL,United States,N
2,1Time Airline,1T,RNX,NEXTIME,South Africa,Y
3,2 Sqn No 1 Elementary Flying Training School,NaN,WYT,NaN,United Kingdom,N
4,213 Flight Unit,NaN,TFU,NaN,Russia,N

In [11]:
# tail() method give last 5 rows data from file
data.tail()

                        Name IATA ICAO         Callsign        Country Active
6156             GX Airlines  NaN  CBG            SPRAY          China      Y
6157  Lynx Aviation (L3/SSX)  NaN  SSX           Shasta  United States      N
6158         Jetgo Australia   JG   \N              NaN      Australia      Y
6159            Air Carnival   2S   \N              NaN          India      Y
6160           Svyaz Rossiya   7R  SJM  RussianConnecty         Russia      Y

In [12]:
data.shape

(6161, 6)

In [13]:
data.columns

Index(['Name', 'IATA', 'ICAO', 'Callsign', 'Country', 'Active'], dtype='object')

In [33]:
data['Country']

0                  NaN
1        United States
2         South Africa
3       United Kingdom
4               Russia
             ...
6156             China
6157     United States
6158         Australia
6159             India
6160            Russia
Name: Country, Length: 6161, dtype: object

In [34]:
data.isnull().sum()

Name           0
IATA        4627
ICAO          86
Callsign     808
Country       15
Active         0
dtype: int64

In [35]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6161 entries, 0 to 6160
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      6161 non-null   object
 1   IATA      1534 non-null   object
 2   ICAO      6075 non-null   object
 3   Callsign  5353 non-null   object
 4   Country   6146 non-null   object
 5   Active    6161 non-null   object
dtypes: object(6)
memory usage: 288.9+ KB

In [36]:
data.describe()

                   Name  IATA  ICAO Callsign        Country Active
count              6161  1534  6075     5353           6146   6161
unique             6072  1121  5854     5262            277      3
top     Royal Air Force    1I    \N     Inc.  United States      N
freq                  5     7   188       20           1099   4906

Pandas DataFrame
- Pandas has a two dimensional data structure with corresponding labels is known as DataFrame.
- Spreadsheets used in Excel or Calc or SQL tables are similar to DataFrames.
- Pandas DataFrame consists of three main components: the data, the index and the columns.

Creating a Pandas DataFrame

In [37]:
mylist2=['Venom','Scarlete','Thomas','James']
DF=pd.DataFrame(mylist2)
DF2=pd.DataFrame([10,20,30,40,50],columns=["Numbers"])
print(DF)
print(DF2)

          0
0     Venom
1  Scarlete
2    Thomas
3     James
   Numbers
0       10
1       20
2       30
3       40
4       50

Creating DataFrame from dictionary of ndarray / lists<br>
Note: To generate a DataFrame from a dict of ndarray/lists, each narray must be the same length.

In [38]:
mydict={'Name':['Carl','Keni','Stark','George'],'Age':[20,25,19,18]}
DF=pd.DataFrame(mydict)
print(DF)

     Name  Age
0    Carl   20
1    Keni   25
2   Stark   19
3  George   18

Reindexing
- Reindexing modifies the row and column labels of DataFrame.
- It denotes verifying that the data corresponds to a specific set of labels along an estabished axis.
- To reindex the DataFrame, use the reindex() function.
- Values in the new index that do not have matching records in the DataFrame are by default given the value NaN.

In [39]:
rein=pd.DataFrame({"P":[1,2,3,4,5],"Q":[5,6,7,8,9],"R":[12,13,14,15,16],"S":[17,18,19,20,16]},index=["A","B","C","D","E"])
rein

   P  Q   R   S
A  1  5  12  17
B  2  6  13  18
C  3  7  14  19
D  4  8  15  20
E  5  9  16  16

In [41]:
# Notice that the new indexes are populated with NaN values
rein.reindex(["1","2","3","4","5"])

    P   Q   R   S
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
4 NaN NaN NaN NaN
5 NaN NaN NaN NaN

In [42]:
# We can fill in the missing values using the fill_value parameter
rein.reindex(["a","b","c","d","e"],fill_value=25)

    P   Q   R   S
a  25  25  25  25
b  25  25  25  25
c  25  25  25  25
d  25  25  25  25
e  25  25  25  25